sysbench_oltp_insert_1x1x1.log
```
[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=1 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 1 tps: 303.32 qps: 303.32 (r/w/o: 0.00/303.32/0.00) lat (ms,99%): 5.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 303.72 qps: 303.72 (r/w/o: 0.00/303.72/0.00) lat (ms,99%): 4.82 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 1 tps: 310.25 qps: 310.25 (r/w/o: 0.00/310.25/0.00) lat (ms,99%): 4.41 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 1 tps: 302.73 qps: 302.73 (r/w/o: 0.00/302.73/0.00) lat (ms,99%): 4.82 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           36602
        other:                           0
        total:                           36602
    transactions:                        36602  (305.01 per sec.)
    queries:                             36602  (305.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0025s
    total number of events:              36602

Latency (ms):
         min:                                    2.60
         avg:                                    3.27
         max:                                   18.95
         99th percentile:                        4.74
         sum:                               119842.29

Threads fairness:
    events (avg/stddev):           36602.0000/0.00
    execution time (avg/stddev):   119.8423/0.00

[root@10-13-88-248 deploy]# ^C
[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=4 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 4 tps: 859.06 qps: 859.06 (r/w/o: 0.00/859.06/0.00) lat (ms,99%): 7.04 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 804.83 qps: 804.83 (r/w/o: 0.00/804.83/0.00) lat (ms,99%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 805.27 qps: 805.27 (r/w/o: 0.00/805.27/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 803.87 qps: 803.87 (r/w/o: 0.00/803.87/0.00) lat (ms,99%): 7.17 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           98196
        other:                           0
        total:                           98196
    transactions:                        98196  (817.91 per sec.)
    queries:                             98196  (817.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0558s
    total number of events:              98196

Latency (ms):
         min:                                    2.60
         avg:                                    4.88
         max:                                  218.83
         99th percentile:                        7.70
         sum:                               479626.60

Threads fairness:
    events (avg/stddev):           24549.0000/723.49
    execution time (avg/stddev):   119.9066/0.02

[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=8 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 8 tps: 850.09 qps: 850.09 (r/w/o: 0.00/850.09/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 796.67 qps: 796.67 (r/w/o: 0.00/796.67/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 795.50 qps: 795.50 (r/w/o: 0.00/795.50/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 7 tps: 796.43 qps: 796.43 (r/w/o: 0.00/796.43/0.00) lat (ms,99%): 215.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           97170
        other:                           0
        total:                           97170
    transactions:                        97170  (809.70 per sec.)
    queries:                             97170  (809.70 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0065s
    total number of events:              97170

Latency (ms):
         min:                                    2.43
         avg:                                    9.87
         max:                                  429.83
         99th percentile:                      215.44
         sum:                               959551.34

Threads fairness:
    events (avg/stddev):           12146.2500/803.20
    execution time (avg/stddev):   119.9439/0.00

[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=16 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 16 tps: 841.11 qps: 841.11 (r/w/o: 0.00/841.11/0.00) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 786.94 qps: 786.94 (r/w/o: 0.00/786.94/0.00) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 784.36 qps: 784.36 (r/w/o: 0.00/784.36/0.00) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 783.17 qps: 783.17 (r/w/o: 0.00/783.17/0.00) lat (ms,99%): 219.36 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           95885
        other:                           0
        total:                           95885
    transactions:                        95885  (798.87 per sec.)
    queries:                             95885  (798.87 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0248s
    total number of events:              95885

Latency (ms):
         min:                                    2.72
         avg:                                   20.02
         max:                                 3168.99
         99th percentile:                      219.36
         sum:                              1919813.05

Threads fairness:
    events (avg/stddev):           5992.8125/488.46
    execution time (avg/stddev):   119.9883/0.01

[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=32 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 32 tps: 827.93 qps: 827.93 (r/w/o: 0.00/827.93/0.00) lat (ms,99%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 774.38 qps: 774.38 (r/w/o: 0.00/774.38/0.00) lat (ms,99%): 427.07 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 777.73 qps: 777.73 (r/w/o: 0.00/777.73/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 776.58 qps: 776.58 (r/w/o: 0.00/776.58/0.00) lat (ms,99%): 634.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           94732
        other:                           0
        total:                           94732
    transactions:                        94732  (787.46 per sec.)
    queries:                             94732  (787.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.2992s
    total number of events:              94732

Latency (ms):
         min:                                    2.27
         avg:                                   40.59
         max:                                 3370.42
         99th percentile:                      434.83
         sum:                              3844878.29

Threads fairness:
    events (avg/stddev):           2960.3750/825.72
    execution time (avg/stddev):   120.1524/0.04

[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=64 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 64 tps: 822.02 qps: 822.02 (r/w/o: 0.00/822.02/0.00) lat (ms,99%): 1453.01 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 774.63 qps: 774.63 (r/w/o: 0.00/774.63/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 64 tps: 772.31 qps: 772.31 (r/w/o: 0.00/772.31/0.00) lat (ms,99%): 1506.29 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 64 tps: 772.12 qps: 772.12 (r/w/o: 0.00/772.12/0.00) lat (ms,99%): 1678.14 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           94298
        other:                           0
        total:                           94298
    transactions:                        94298  (767.66 per sec.)
    queries:                             94298  (767.66 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          122.8383s
    total number of events:              94298

Latency (ms):
         min:                                    2.40
         avg:                                   81.74
         max:                               107189.08
         99th percentile:                     1506.29
         sum:                              7707680.86

Threads fairness:
    events (avg/stddev):           1473.4062/314.42
    execution time (avg/stddev):   120.4325/0.70

[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=128 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 128 tps: 815.84 qps: 815.84 (r/w/o: 0.00/815.84/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 770.10 qps: 770.10 (r/w/o: 0.00/770.10/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 128 tps: 771.51 qps: 771.51 (r/w/o: 0.00/771.51/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 128 tps: 770.71 qps: 770.71 (r/w/o: 0.00/770.71/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 97 tps: 3.73 qps: 3.73 (r/w/o: 0.00/3.73/0.00) lat (ms,99%): 100000.00 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 97 tps: 0.20 qps: 0.20 (r/w/o: 0.00/0.20/0.00) lat (ms,99%): 100000.00 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 97 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           93974
        other:                           0
        total:                           93974
    transactions:                        93974  (418.07 per sec.)
    queries:                             93974  (418.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          224.7813s
    total number of events:              93974

Latency (ms):
         min:                                    2.17
         avg:                                  175.78
         max:                               224564.88
         99th percentile:                     1708.63
         sum:                             16518376.75

Threads fairness:
    events (avg/stddev):           734.1719/379.78
    execution time (avg/stddev):   129.0498/20.98

[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=25 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 25
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

^C
[root@10-13-88-248 deploy]# sysbench --config-file=sysbench.conf oltp_insert --tables=32 --threads=256 run
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 256
Report intermediate results every 30 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 30s ] thds: 256 tps: 817.68 qps: 817.68 (r/w/o: 0.00/817.68/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 256 tps: 772.20 qps: 772.20 (r/w/o: 0.00/772.20/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 256 tps: 772.77 qps: 772.77 (r/w/o: 0.00/772.77/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 256 tps: 774.16 qps: 774.16 (r/w/o: 0.00/774.16/0.00) lat (ms,99%): 1708.63 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 256 tps: 3.77 qps: 3.77 (r/w/o: 0.00/3.77/0.00) lat (ms,99%): 100000.00 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 256 tps: 0.13 qps: 0.13 (r/w/o: 0.00/0.13/0.00) lat (ms,99%): 100000.00 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 256 tps: 0.00 qps: 0.00 (r/w/o: 0.00/0.00/0.00) lat (ms,99%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           94361
        other:                           0
        total:                           94361
    transactions:                        94361  (412.13 per sec.)
    queries:                             94361  (412.13 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          228.9597s
    total number of events:              94361

Latency (ms):
         min:                                    2.21
         avg:                                  486.55
         max:                               228801.67
         99th percentile:                     3151.62
         sum:                             45911228.47

Threads fairness:
    events (avg/stddev):           368.5977/453.66
    execution time (avg/stddev):   179.3407/51.10
```